etc/templates/inflowOutflowRotating/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          10;

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        meanVelocity    constant $Uinlet;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    // For an MRF case, the rotating patch requires the MRFnoSlip BC
    // For an NCC case, it requires a movingWallVelocity BC
    // If steadyState, assume the case is MRF; otherwise, NCC.
    rotating
    {
        timeScheme      ${${FOAM_CASE}/system/fvSchemes!ddtSchemes/default};
    #ifeq $timeScheme steadyState
        type            MRFnoSlip;
    #else
        type            movingWallVelocity;
    #endif
        value           uniform (0 0 0);
    }

    wall
    {
        type            noSlip;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
